app/controllers/flats_controller.rb

SELECT "flats".* FROM "flats"
---
    def index
        @flats = Flat.all

SELECT "flats".* FROM "flats" WHERE "flats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @flat = Flat.find(params[:id])